[
    {
        "id": "19452",
        "title": "HGC_NWExtrem.wad",
        "filename": "hgc_nwextrem.zip",
        "author": "Hans George Campbell",
        "date": "2019-10-05",
        "size": "3687527",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/g-i/hgc_nwextrem",
        "description": "This is the final version of my famous Night Wedding wad. It has been revised to take advantage of GZDoom's lighting effects.",
        "visited": "Yes"
    },
    {
        "id": "13551",
        "title": "Showdown",
        "filename": "dmshow.zip",
        "author": "Rick DeMar",
        "date": "2005-05-26",
        "size": "16705",
        "rating": "1.5",
        "votes": "2",
        "url": "https://www.doomworld.com/idgames/levels/doom/d-f/dmshow",
        "description": "I call this particular level \"Showdown\". The reason for this is probably most apparent early in the game. My favorite four of the enemy list are represented here in droves, and classy weapons and bonuses abound (except for the BFG- 9000, which I thought made things a little too easy, and we can't have that...), as well as some crafty secrets and traps.<br><br> Four things to remember while playing:<br><br> 1:Watch your ammo levels (health too!!) 2:Watch your ass as well! 3:If it smells like a trap, it probably is... 4:All secrets are in sequence; if you miss one, you won't be able to leave!<br><br> It is a real run for your money, but if you keep these things in mind, it's acually kind of easy after awhile ;) . BTW: Don't forget about the strafe maneuver!!",
        "visited": "Yes"
    },
    {
        "id": "14118",
        "title": "Duplex",
        "filename": "dac7.zip",
        "author": "Dr. Zin",
        "date": "2006-01-21",
        "size": "625388",
        "rating": "3.8",
        "votes": "10",
        "url": "https://www.doomworld.com/idgames/themes/DAC/dac2005/dac7",
        "description": "A big split techbase for the Advent 2005 map pack. Please use this version instead of the one under DAC7, as this fixes the Keen bug.",
        "visited": "Yes"
    },
    {
        "id": "18914",
        "title": "The Shores of Russia",
        "filename": "shorus.zip",
        "author": "Chaingunner, Joe-Ilya, Memfis",
        "date": "2017-11-02",
        "size": "347038",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom/Ports/s-u/shorus",
        "description": "Three authors, three limit removing maps. Welcome to the shores of Russia.<br><br> e2m1 - Chaingunner e2m2 - joe-ilya e2m3 - Memfis",
        "visited": "Yes"
    },
    {
        "id": "39",
        "title": "None",
        "filename": "fez2.zip",
        "author": "Grahame Fairall",
        "date": "1994-05-06",
        "size": "56534",
        "rating": "2.5",
        "votes": "4",
        "url": "https://www.doomworld.com/idgames/levels/doom/d-f/fez2",
        "description": "Second wad in the 'fez' collection (OK I know it's also E1M1)......lots more evil traps and secrets and a heap more experimentation but predominantly lots of blasting............<br><br> It's hard but everything is possible... however unlikely that may seem....I can do it...<br><br> Now remember......whatever you do.....<br><br> ...make the most of that invincibility..<br><br> As usual all comments/bug reports will be gratefully received....why not send me your wad.....",
        "visited": "Yes"
    },
    {
        "id": "13631",
        "title": "MUDWADS Yeah, thats rite. MUD WAD'S",
        "filename": "dmmud.zip",
        "author": "Dave Swift",
        "date": "2005-06-16",
        "size": "115308",
        "rating": "2.6667",
        "votes": "6",
        "url": "https://www.doomworld.com/idgames/levels/doom/d-f/dmmud",
        "description": "MUD1ST.WAD - My first full length, feature epic type challenge worthy of anyones GOD mode. This beauty has more monsters and demons than you can shake four rocket launchers at. There's a key hidden that you need to get into the room that goes to the next level. All difficulties are the same... hard! There is a lot going on so this may tax some less than lightspeed machines but you got it all here. Some secret rooms will help you. Bigtime.<br><br> MUDTOWN.WAD - Second one here, this one does have an easier difficuly setting (easier than totally impossible) and has more acurate texture matches for all areas and more refined challenges. There's a key hidden that you have to find to get into the room to the next level. Watch out on Diff 3/4 - it'll work you! Diff 1/2 are the same - doable. Good luck.<br><br> MUDVILLE.WAD - Third one's the charm. Well, there are teleporters and more new stuff... for me to do anyway. A good technical game. No secret rooms to speak of but a real good challenge for the purist. Diff 1/2 are doable... not too hard actually. 3/4 are another story. Strap on the big gun. Loop around and catch the trip wire to the door. Hang on!<br><br> MUDMANOR.WAD - This one is more and better.... skill levels cover possible to impossible. Ample weapons in the possible levels. Perhaps enough in the more difficult \"impossible\" levels too. No keys but it is necessary to take the long way around to finish. Enjoy!<br><br> What's with Mud, you may ask. And well you may. I am Pres of The West Mountain Mudbrothers Mountainbiking Club and as such the word (and substance) have a great deal of significance in everyday life. Besides how else would you know for sure that it was the \"Muds\" work unless I made it obvious when you tabbed to map in strategic spots.",
        "visited": "Yes"
    },
    {
        "id": "9438",
        "title": "The DOOM matrix utilties",
        "filename": "wtf-dmu.zip",
        "author": "WTF Productions",
        "date": "1998-05-25",
        "size": "36623",
        "rating": "0.5",
        "votes": "2",
        "url": "https://www.doomworld.com/idgames/themes/wtf/wtf-dmu",
        "description": "This ZIP file contains all you need to keep track of the scores during\na DOOM fest. It works fully automatic with batchfiles created with a \nhelpful front-end tool. Manual is included, tools are FREEWARE!!",
        "visited": "Yes"
    },
    {
        "id": "16567",
        "title": "Fae Pente",
        "filename": "faepente.zip",
        "author": "Michael \"Optimus\" Kargas",
        "date": "2011-09-02",
        "size": "28320",
        "rating": "0.5294",
        "votes": "17",
        "url": "https://www.doomworld.com/idgames/levels/doom/d-f/faepente",
        "description": "I was inspired by 5 minutes WAD and it came very bad!!!",
        "visited": "Yes"
    },
    {
        "id": "16567",
        "title": "Doom 404",
        "filename": "doom404.zip",
        "author": "Adam Windsor / Capellan",
        "date": "2018-12-02",
        "size": "1097423",
        "rating": "0.0000",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/megawads/doom404",
        "description": "It's a sad life on the Space Marine IT Help Desk. Especially when you're stuck on the graveyard shift. Night after night of \"Did you try rebooting?\" Not exactly what you expected when you signed up.<br><br> You figured this call would be more of the same: some garbled voice mail about \"gremlins in the system\". Gremlins? Seriously, how old is the guy who left that? Ninety five? He probably remembers vacuum tubes.<br><br> Now you're here though, something isn't right. This facility should be busy, but it's silent. Almost desolate. You're starting to feel glad you brought that popgun they issued you with to make you look like a real soldier ...",
        "visited": "Yes"
    },
    {
        "id": "17980",
        "title": "Abyssal Speedmapping Sessions: Session 14",
        "filename": "abyspe14.zip",
        "author": "Obsidian Jimmy Unholypimpin Scifista42 TheMionicDonut SlashBane AD_79 Alfonzo Breezeep General Rainb",
        "date": "2015-01-29",
        "size": "544203",
        "rating": "1.5714",
        "votes": "14",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/a-c/abyspe14",
        "description": "11 maps made during the eleventh Abyssal Speedmapping Session in the space of two hours, with 15 minutes for music and texture selection and 15 minutes for bugfixing. Each mapper had 3 themes to choose from:<br><br> - Raising stairs function - Perpetual moving floors - Lite-Amp goggles<br><br> Alfonzo, AD_79 and SlashBane used the Alfonzo treatment and SlashBane used another 20 minutes or so.",
        "visited": "Yes"
    },
    {
        "id": "14081",
        "title": "Such a Pretty Sight",
        "filename": "dm2sig.zip",
        "author": "Ashley Gilliam",
        "date": "2005-12-30",
        "size": "17743",
        "rating": "4.0",
        "votes": "1",
        "url": "https://www.doomworld.com/idgames/levels/doom2/deathmatch/d-f/dm2sig",
        "description": "This is a small WAD for Deathmatch. Set on a small islandish piece of ground. A few hiding places, some interesting spaces, and some delightful surprise kills.<br><br> Story: It is such a pretty view you'd just like to sit and enjoy it--but that other guy with the shotgun just isn't gonna let you!",
        "visited": "Yes"
    },
    {
        "id": "19503",
        "title": "Hell House",
        "filename": "hellhouse.zip",
        "author": "LunaticRedEyes1",
        "date": "2019-12-15",
        "size": "9691",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/g-i/hellhouse",
        "description": "Strange noises have been heard coming from the local abandoned mansion. Of course, the demon slayer extraordinaire himself is here to see what's going on.<br><br> My first serious mapping project.",
        "visited": "Yes"
    },
    {
        "id": "12185",
        "title": "FYP",
        "filename": "fyp.zip",
        "author": "Jow",
        "date": "2003-09-12",
        "size": "1042594",
        "rating": "2.6667",
        "votes": "6",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/d-f/fyp",
        "description": "Made in a hatred feeling towards a certain person...",
        "visited": "Yes"
    },
    {
        "id": "12863",
        "title": "Lamentations",
        "filename": "dmdlamdm.zip",
        "author": "Derek \"Afterglow\" MacDonald",
        "date": "2004-09-25",
        "size": "830913",
        "rating": "4.3333",
        "votes": "6",
        "url": "https://www.doomworld.com/idgames/levels/doom2/deathmatch/Ports/d-f/dmdlamdm",
        "description": "A collection of six deathmatch-only levels, ranging from tiny and annoying to large and tedious.",
        "visited": "Yes"
    },
    {
        "id": "20814",
        "title": "PUSS XXIV: Lover's Quarrel",
        "filename": "lvrsqrrl.zip",
        "author": "Various authors Project leads: Peccatum Mihzamiz and Myolden",
        "date": "2023-08-02",
        "size": "21998719",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/megawads/lvrsqrrl",
        "description": "Lover's Quarrel is a Valentine's Day themed 32 map megawad created for Deathmatch, Single Player and co-op.<br><br> It's Valentine's Day but alas, Love is hard, and you and your partner seem to be having a quarrel. Sometimes the best way to solve a quarrel is to fight through it!",
        "visited": "Yes"
    },
    {
        "id": "13852",
        "title": "The Weapons Resource Wad",
        "filename": "wrw.zip",
        "author": "Several",
        "date": "2005-10-06",
        "size": "2960909",
        "rating": "3.6716",
        "votes": "67",
        "url": "https://www.doomworld.com/idgames/combos/wrw",
        "description": "A spin-off of the Monster Resource WAD, this is a collection of DECORATE weapons created by the ZDoom community. Authors are allowed to freely use and/or modify any of the weapons and sprites contained in this wad to their heart's content.",
        "visited": "Yes"
    },
    {
        "id": "11353",
        "title": "Snipe - Paintball Arena",
        "filename": "snipe3.zip",
        "author": "Radtard",
        "date": "2001-08-26",
        "size": "24230",
        "rating": "1.0",
        "votes": "1",
        "url": "https://www.doomworld.com/idgames/levels/doom2/deathmatch/s-u/snipe3",
        "description": "An exact emulation of a paintball arena I once played on",
        "visited": "Yes"
    },
    {
        "id": "20153",
        "title": "Vanilla Cake Carnage",
        "filename": "vcc.zip",
        "author": "Timothy Brown (MArt1And00m3r11339)",
        "date": "2022-01-26",
        "size": "3025257",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/v-z/vcc",
        "description": "Alright all you trash kickers. I am at you with another cake slaughter map. This one is titled \"Vanilla Cake Carnage\". It has a lot of yellow and white in it. It is a fairly tough map so good luck surviving it. Play through can be found here: https://youtu.be/ZWq2KO7Z1VY",
        "visited": "Yes"
    },
    {
        "id": "87",
        "title": "TNCROSS2",
        "filename": "tncross2.zip",
        "author": "}-Valis-{",
        "date": "1994-05-12",
        "size": "12253",
        "rating": "1.5",
        "votes": "2",
        "url": "https://www.doomworld.com/idgames/levels/doom/s-u/tncross2",
        "description": "Well, perhaps it's time to update this.  No elaborate maps of New\nJersey, no amateurish clipping errors to put up with...  just a clean\nand slightly diabolical level for the dedicated Deathmatch player!  A\nfew secret passages provide opportunities for healthy backstabbing and\nrabbit punching, just the way you like it.  :-)   Other secrets and\nphysical feats abound.  A few monsters thrown in to keep everyone\nhonest...",
        "visited": "Yes"
    },
    {
        "id": "13404",
        "title": "STATUES.WAD",
        "filename": "dmstat.zip",
        "author": "Michael A. Palmer",
        "date": "2005-04-29",
        "size": "33529",
        "rating": "0.0",
        "votes": "1",
        "url": "https://www.doomworld.com/idgames/levels/doom/deathmatch/d-f/dmstat",
        "description": "This is my first go at a doom level. It tends to reflect my liking for large rooms which don't look too dangerous initially.<br><br> I think it is a reasonable test for the average player, although I suspect the real experts won't have too much difficulty.<br><br> There's nothing silly like Cyberdemons and all the problems have solutions, I promise. There's plenty of ammo and weapons about, especially if you find all the secret rooms.<br><br> It runs at acceptable speed on my lowly 20 MHz 486sx.<br><br> It's very much designed for single play, so I've not set it up for multiple players.",
        "visited": "Yes"
    },
    {
        "id": "16232",
        "title": "Colossus",
        "filename": "colossus.zip",
        "author": "Wraith",
        "date": "2010-10-30",
        "size": "530066",
        "rating": "2.3103",
        "votes": "29",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/a-c/colossus",
        "description": "It's a really big map for doom2. Absolutely HARD, and i'ts my best map at the moment. Enjoy it! :)",
        "visited": "Yes"
    },
    {
        "id": "5314",
        "title": "TOWER ASSAULT - FINAL VERSION 1.0",
        "filename": "tower.zip",
        "author": "Michel PERIE a.k.a NEMESIS.",
        "date": "1996-03-30",
        "size": "658681",
        "rating": "3.5",
        "votes": "2",
        "url": "https://www.doomworld.com/idgames/levels/heretic/s-u/tower",
        "description": "It was especially dezigned for Cooperation. Very cool!! HAVE YOU EVER DREAMED OF A GAME MIXING -DOOM- -HERETIC- and -HEXEN-? Yeah? Then load this level and get the new atmosphere out of it!!!! DAMN!!! Check the new AWESOME graphics and sounds out! It is really worth the Download, isn't it?",
        "visited": "Yes"
    },
    {
        "id": "6384",
        "title": "DARK SIDE OF PHOBOS 2.0",
        "filename": "darkside.zip",
        "author": "Michael 'Vampyr' Palomino",
        "date": "1996-07-03",
        "size": "126899",
        "rating": "2.75",
        "votes": "4",
        "url": "https://www.doomworld.com/idgames/levels/doom/d-f/darkside",
        "description": "The scenario takes place between E2 and E3, you recieve a garbled transmission from somewhere in space, tracing the source, the signal is being bounced off a relay sattelite, it's coming from the Dark Side of Phobos. How? You ask yourself, there's nothing on the dark side, unless...there was another experiment. You stuff with pack with shells as you review the message again. A young man's face, bruised and bleeding at the corner of his mouth whimpers at the telecom. Pleading for help, he explains that he is on a six man outpost, built on the dark side of Phobos, working on the same project (they were the backup in case the first test failed) that started this whole mess. He explains that after opening their 'tri-dimensional' gates, the things started swarming into the complex. Your heart sinks as his transmission fades to static You're determined to get over there, and hope you can bring some survivors out of this.<br><br> Side note: This level is made primarily for single, or coop play. I enjoy small, fast and furious Doom levels not large complex labyrinths with tons of monsters. compared to many wads I've played, my wad doesn't have many monsters, I prefer a more subtle, close combat, with plenty of traps sprinkled in for taste ;)<br><br> I also slightly modified the level to make it more fluid for deathmatch, which I've tested and it works great.<br><br> My favorite part of this level is the, choose a door part (you'll know it when you get there. Now I'm not saying they're easy, but they are survivable. All in all I think it's a good blend of monsters, weapons, traps and surprises. More experienced players will probably breeze through it, but I'm hoping my traps will catch em off guard. =)",
        "visited": "Yes"
    },
    {
        "id": "8801",
        "title": "DOSDoom v0.1",
        "filename": "dosdoom.zip",
        "author": "Chi Hoang",
        "date": "1997-12-23",
        "size": "206647",
        "rating": "3.1429",
        "votes": "7",
        "url": "https://www.doomworld.com/idgames/source/dosdoom",
        "description": "Well, today, id software released the doom source code, but only for\nthe linux version.  Since i don't happen to have linux installed on my\nmachine, i decided to port it to dos.  This little exe is the result.  You\nmight need cwsdpmi.exe, so copy it from your quake dir if you dont have it.\nThis has only been tested on my computer, with DOOM 2.",
        "visited": "Yes"
    },
    {
        "id": "16431",
        "title": "TMP.WAD",
        "filename": "tmp.zip",
        "author": "unknown",
        "date": "2011-04-19",
        "size": "64019",
        "rating": "4.2174",
        "votes": "23",
        "url": "https://www.doomworld.com/idgames/levels/doom/s-u/tmp",
        "description": "TMP.WAD was the winner of a PC Zone Doom level creation competition in 1994.",
        "visited": "Yes"
    },
    {
        "id": "21333",
        "title": "60 Minute Marathon 2",
        "filename": "60mm2.zip",
        "author": "NiGHTS108, Synami, Phoenyx, OverflowingMocha, Tonytheparrot, Monsieur E, Scionox, Fumingbow639067",
        "date": "2024-09-08",
        "size": "2364873",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/megawads/60mm2",
        "description": "\"WAD of the year is here and absolutely nobody is ready for it.\" - Maribo, on May 1st 2023 in the replies of the Goodwad, I mean 60 Minute Marathon release thread.<br><br> Oh yes my friends. It is happening again. 60 Minute Marathon 2 is a 74-map MBF21-compatible gigawad made (mostly) in a single hour, just like last time, but with more than twice the friends, including me, Synami, and new friends Phoenyx and OverflowingMocha, twice the \"production quality\" as last time, and even a completely bespoke soundtrack made by Phoenyx! Much like the first 60 Minute Marathon, this was mostly a fairly simple yet somewhat extreme mapping exercise, this time with four mappers all making 16 maps over an hour and deciding to jam them all together at the end alternating between each mapper, with maps only being edited after the designated hour to actually make them possible. Let the slopping begin!",
        "visited": "Yes"
    },
    {
        "id": "11622",
        "title": "Monster Base",
        "filename": "base666.zip",
        "author": "Richard J. Sham",
        "date": "2002-08-07",
        "size": "551737",
        "rating": "3.0",
        "votes": "4",
        "url": "https://www.doomworld.com/idgames/levels/doom2/a-c/base666",
        "description": "This is a medium size level (took me 25:28 to record in UV) that offers a variety of architecture and good gameplay. Plenty of shells so blast away! All skill levels have been set and tested for health, ammo and playability. UV is best played by experienced Doomers but HMP is just as much fun. If anyone can beat this level please send your lmp (UV or HMP) as I'm sure I'd enjoy watching the action. Getting weapons in the opening may seem a little tricky but it just takes a few attempts to find and retrieve them.",
        "visited": "Yes"
    },
    {
        "id": "2788",
        "title": "Very Small Level.",
        "filename": "small.zip",
        "author": "Jason Garoutte (aka J*Dog)",
        "date": "1995-07-27",
        "size": "29008",
        "rating": "3.6667",
        "votes": "3",
        "url": "https://www.doomworld.com/idgames/levels/doom2/s-u/small",
        "description": "This is a very little level. This is one of my first levels and you'll probably be able to tell.",
        "visited": "Yes"
    },
    {
        "id": "4468",
        "title": "Cannons - 1/8/96",
        "filename": "cannons.zip",
        "author": "Brit Willoughby",
        "date": "1996-01-20",
        "size": "43104",
        "rating": "4.0",
        "votes": "3",
        "url": "https://www.doomworld.com/idgames/levels/hexen/a-c/cannons",
        "description": "This will take some explaining... This wad is not like any other wad you've ever played. You play it in COOP mode, but are trying to kill each other. You use the switches on the platform to aim your cannon at your target, and blast him! Over 1250 lines of script to drive it! See notes below for more info.",
        "visited": "Yes"
    },
    {
        "id": "18487",
        "title": "HAZCHEM",
        "filename": "hazchem.zip",
        "author": "Ashicide",
        "date": "2016-06-29",
        "size": "27799",
        "rating": "3.1111",
        "votes": "18",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/g-i/hazchem",
        "description": "So this is my first map, it's called HAZCHEM, and there's really nothing special about it. It being my first map and all, it's gonna be really REALLY shit and sloppy, and I didn't want to overshoot and make big ambitious maps, so all this is is just a quick MAP01 replacement. It wasn't built to be hard at all, you should find UV a breeze, and even moreso on lower levels of difficulty.<br><br> I have added a couple of secrets though, but as proud of them as I am, they're probably quite basic, but they're there nonetheless.",
        "visited": "Yes"
    },
    {
        "id": "18136",
        "title": "Prototype",
        "filename": "proto.zip",
        "author": "Molten_",
        "date": "2015-07-09",
        "size": "268463",
        "rating": "3.1667",
        "votes": "12",
        "url": "https://www.doomworld.com/idgames/levels/doom/Ports/p-r/proto",
        "description": "Episode 4 is my favorite episode of Ultimate Doom, so I decided to start making my own mapset for it. I originally planned to make all 9 maps but unfortunately work got in the way, so here we are with 4 (Technically 5) maps.",
        "visited": "Yes"
    },
    {
        "id": "12906",
        "title": "Beyond Death",
        "filename": "byddeath.zip",
        "author": "Dan Stefan Oprean a.k.a. Unknown[NF] or AlphaGOD",
        "date": "2004-10-18",
        "size": "872171",
        "rating": "3.7059",
        "votes": "17",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/a-c/byddeath",
        "description": "It was ment to be part of the DWSCP but as the project is taking a major turn we decided to release our works. This was sopposed to be map 27 of the wad.",
        "visited": "Yes"
    },
    {
        "id": "17152",
        "title": "DEATH FORT",
        "filename": "dethfort.zip",
        "author": "Alan E Brown",
        "date": "2013-04-03",
        "size": "39590",
        "rating": "2.6667",
        "votes": "9",
        "url": "https://www.doomworld.com/idgames/levels/doom2/d-f/dethfort",
        "description": "The forth Wad in the series.<br><br> Find your way into the heavily guarded fort and kill the menace who guards the exit. The most difficult part of this level is the sewers. If you `PANIC` in this area you will surely die! Look for a radiation suit as soon as you can and WATCH OUT!! a monster`s about.",
        "visited": "Yes"
    },
    {
        "id": "18329",
        "title": "Abyssal Speedmapping Session 25",
        "filename": "abyspe25.zip",
        "author": "TheMionicDonut, Jimmy - Project Lead 4shockblast AD_79 alterworldruler CWolfRu FuzzballFox jmickle66",
        "date": "2016-01-15",
        "size": "2007929",
        "rating": "1.5",
        "votes": "8",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/a-c/abyspe25",
        "description": "18 maps made during the twenty-fifth Abyssal Speedmapping Session in the space of 2 hours, with 15 minutes for music and texture selection and 15 minutes after for bugfixing. An additional warning map is also present in the MAP17 slot...<br><br> This session was held in two \"rounds\" for the convenience of folks who couldn't turn up to one or the other.<br><br> Each mapper had 3 themes to choose from (the best themes from the previous 12 months were voted for to celebrate the second birthday of Abyssal Speedmapping Sessions): - Return of the Revenge of M3 (Copious Barrels, session 15) - Scrolling floors in map (Session 20) - Boxes for the Boxing Day! (Crates, session 17)<br><br> Plus a bonus theme for those who showed up to round 2: - Zero use of door specials (from session 20)",
        "visited": "Yes"
    },
    {
        "id": "21162",
        "title": "Forsaken Compound",
        "filename": "compound.zip",
        "author": "Ivymagnapinna",
        "date": "2024-05-12",
        "size": "1924214",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom/Ports/a-c/compound",
        "description": "A 1-episode wad for Doom 1 set in a tech complex integrating itself into Hell. There's blood in the pipes, flesh in the machinery, and the walls won't take their eyes off you. Balanced with both continuous play and pistol starts in mind. Gameplay is slaughtery in some parts, simple and atmosphere/puzzle-oriented in others, I'd say it's definitely harder than your average Knee Deep in the Dead-style wad. I aimed for a sense of difficulty progression and progression through locations/themes, but I've got no story for any of these maps. Use your imagination.",
        "visited": "Yes"
    },
    {
        "id": "17470",
        "title": "50 shades of sam hyde",
        "filename": "shrek4.zip",
        "author": "chesse20",
        "date": "2014-01-25",
        "size": "19221140",
        "rating": "1.7",
        "votes": "10",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/s-u/shrek4",
        "description": "Live out your S&M fantasies with world famous comedian sam hyde.<br><br> <br><br> credit to scfistas for the grayscale<br><br> credit to renard queenston to the music (he has a policy where you can use his music as long as you give credit)",
        "visited": "Yes"
    },
    {
        "id": "16958",
        "title": "Refuge of the Marshlord",
        "filename": "rotml.zip",
        "author": "Fenriswolf",
        "date": "2012-10-05",
        "size": "109655",
        "rating": "3.0",
        "votes": "1",
        "url": "https://www.doomworld.com/idgames/levels/heretic/Ports/rotml",
        "description": "This was originally designed as a part of the Second Heretic Speedmapping session, but after I finished the map I realised they demanded Deathmatch-maps, so this map did not fit into the project. Years later, I found it on my harddrive again and after playing it I thought it was not that bad and worth a release. Of course it is a speedmap and a just a very small level, but I think it is still fun. But just try it ;) A Mapinfo file is included, other than that, the Map does not use any ZDoom features. I recommend playing this with GZDoom, the fog effect just looks cooler then.",
        "visited": "Yes"
    },
    {
        "id": "12635",
        "title": "ARMAS DE JOGOS (Game Weapons)",
        "filename": "a_games.zip",
        "author": "Daniel",
        "date": "2004-06-17",
        "size": "1426842",
        "rating": "4.1176",
        "votes": "34",
        "url": "https://www.doomworld.com/idgames/combos/a_games",
        "description": "Replaces the Doom 2 Weapons with guns of those respective",
        "visited": "Yes"
    },
    {
        "id": "4965",
        "title": "Hangar v3.0",
        "filename": "hangar30.zip",
        "author": "\"KAMIKAZI\" Chris and Michael Niggel",
        "date": "1996-03-05",
        "size": "48999",
        "rating": "2.0",
        "votes": "2",
        "url": "https://www.doomworld.com/idgames/levels/doom/deathmatch/g-i/hangar30",
        "description": "Alright, you're all wondering, \"why is the first level in DOOM called 'Hangar?' when it really isn't a hangar or anything like one?\" Well, now it is. Hangar features new textures, secret areas, a good playing field, and above all, it's a cool place to deathmatch in!",
        "visited": "Yes"
    },
    {
        "id": "19680",
        "title": "Infight For Vacation",
        "filename": "ifv.zip",
        "author": "Maxime \"Datacore85\" Bisiaux",
        "date": "2020-08-14",
        "size": "57690",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/g-i/ifv",
        "description": "None",
        "visited": "Yes"
    },
    {
        "id": "8613",
        "title": "THE BEGINNING OF HELL ON EARTH:  FIFFY'S INTERPRETATION",
        "filename": "1fiffy.zip",
        "author": "George Fiffy",
        "date": "1994-07-16",
        "size": "25385",
        "rating": "1.0588",
        "votes": "17",
        "url": "https://www.doomworld.com/idgames/levels/doom/0-9/1fiffy",
        "description": "After fighting your way through the final end boss of INFERNO, you\nreturn to the plannet Earth after a mission well done. You, B.J.\nBLAZKOWICZ, were part of a big N.Y.C. ticker tape parade to celebrate\nthe end of hell's reign of terror! You then go back home to your wife\nand kids in your 5'th Avenue penthouse.<br><br>\n   While watching Wheel Of Fortune, right when you think you solved\nthe puzzle, a special report interupts your programming. You change\nthe channels, but ALL the stations are airing a report on something\nhorrible happening near the top of Mount McKenley. Daemons from hell\nare building a main HQ building to try and take over the earth! This\ngets you very angry, after all, you thought you solved the puzzle on\nWheel Of Fortune!<br><br>\n   You knew what you had to do. You had to go to Mt. McKenley and\nteach those ingrates a lesson before things get out of hand.<br><br>\n   You arrive to the base from Hell atop Mt. McKenly. It's a big\nmetal building filled to the rim with hell's creatures. You walk in\nand find you are too late. Hell already started throwing Earth into\ntotal chaos, but YOU can reduce the effect! <br><br>\n   Reports state that 24 hours ago they started sending daemons out\ninto the world, through a special EXIT switch scattering these\nbastards all over the plannet. You trip an infared beam, and the\ncreatures re-wire the switch to only bring you to E1M2, and all \nenemies are on full allert to search and destroy you! Most of them\nare hiding secretly throughout the building waiting for you! You never\nknew anything about their technology anyway, so you're objective is\nnot to fix the switch, but to clear the \"metal halls of hell\" so\nno more creatures will wreak havoc on Earth. After all, if all are\ndead, no one can fix the switch, and no one can transport them-\nselves to the four corners of the globe!<br><br>\n  Go in there and kick daemon butt! If you fail, Hell on Earth will\nbecome a force too great for all armies to face.",
        "visited": "Yes"
    },
    {
        "id": "3714",
        "title": "Endless FRAGS",
        "filename": "efrags.zip",
        "author": "Timmy (The J-U-D-G-E)",
        "date": "1995-11-07",
        "size": "14415",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/deathmatch/d-f/efrags",
        "description": "VERY small deathmatch level! I've built it after playing in minideth.wad by Scott A.Smith In 4 player DM - frag every 15 seconds! (or faster) Made for old deathmatch.",
        "visited": "Yes"
    },
    {
        "id": "13957",
        "title": "Hell gate.",
        "filename": "hellgat2.zip",
        "author": "John Cartwright",
        "date": "2005-12-01",
        "size": "34181",
        "rating": "3.0",
        "votes": "3",
        "url": "https://www.doomworld.com/idgames/levels/doom2/g-i/hellgat2",
        "description": "A very good, small map with many Demons out for your blood.",
        "visited": "Yes"
    },
    {
        "id": "14262",
        "title": "The last fortress of hell",
        "filename": "lastfort.zip",
        "author": "Aluqah",
        "date": "2006-03-20",
        "size": "93070",
        "rating": "3.7143",
        "votes": "7",
        "url": "https://www.doomworld.com/idgames/levels/doom2/j-l/lastfort",
        "description": "A fortress in hell. This is my wad #14<br><br> Story: You have finish your last mision in hell and wan't to return home. But the only way out is in this well guarded fortress.<br><br> Note: you don't need to make the barrels explode and you can kill deamons without doing it",
        "visited": "Yes"
    },
    {
        "id": "21345",
        "title": "The Moon",
        "filename": "moon.zip",
        "author": "dashiefrickintyan",
        "date": "2024-09-22",
        "size": "2008088",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/m-o/moon",
        "description": "happy birthday, brendan. ur old:)",
        "visited": "Yes"
    },
    {
        "id": "19566",
        "title": "Skinship",
        "filename": "skinship.zip",
        "author": "Michal ''Lorenzo'' Kurowski",
        "date": "2020-03-08",
        "size": "7063235",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/s-u/skinship",
        "description": "Skinship is a large map for GZDoom with four new custom monsters, replacements for the cacodemon, imp, hellknight and baron of hell. They were all taken from realm667 and modified by me for balance's sake. Freelook is recommended. Dynamic lights should be turned on. Otherwise, important switches could be missed. <br><br> The textures used are a mix of default ones, MISCTEX and Doom Potpourri. There are a few textures from outside of those packs, made by ChaingunnerX, BLAZING_DUST, Absorbed Hatch.",
        "visited": "Yes"
    },
    {
        "id": "21068",
        "title": "Re-Entryway: A Reinterpretation of MAP01",
        "filename": "re-entry.zip",
        "author": "kinker31",
        "date": "2024-02-18",
        "size": "29741",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/p-r/re-entry",
        "description": "Re-made Doom 2's Entryway one day, mostly for fun. Made with vanilla limitations in mind, and can be fully beaten with Chocolate Doom. This wad only has the single map, no other lumps are included.",
        "visited": "Yes"
    },
    {
        "id": "3177",
        "title": "Dan Deathmatch Level #1 (Trailer Park)",
        "filename": "dandeth1.zip",
        "author": "Dan Bateman",
        "date": "1995-09-01",
        "size": "29073",
        "rating": "3.5",
        "votes": "2",
        "url": "https://www.doomworld.com/idgames/levels/doom2/d-f/dandeth1",
        "description": "I was recently travelling through West Virginia and saw a neat paintball playing field consisting of a fenced-in area with several old trailers. The trailers had no doors or windows, and I immediately thought something like that would make a good Deathmatch level. So, here it is, but none of that paintball crap, here you can frag your friends with live ammo!",
        "visited": "Yes"
    },
    {
        "id": "19559",
        "title": "Running Late 2",
        "filename": "rl2.zip",
        "author": "A2Rob",
        "date": "2020-02-19",
        "size": "12342226",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/megawads/rl2",
        "description": "16-ish Boom compatible levels. ZDoom based ports will have to level warp in order to access the secret levels, since Map14 sends you to the EndDoom screen. BOOM ports can access these maps regularly from Map15.",
        "visited": "Yes"
    },
    {
        "id": "20977",
        "title": "Hairesis",
        "filename": "hairesis.zip",
        "author": "Demonologist",
        "date": "2023-12-21",
        "size": "4490852",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/g-i/hairesis",
        "description": "Single OTEX-driven medium-sized map of middling difficulty made for Russian Doomcon - the 30th Anniversary of Doom.",
        "visited": "Yes"
    },
    {
        "id": "13695",
        "title": "Do you have the guts?",
        "filename": "guts.zip",
        "author": "Bjarne Christensen",
        "date": "2005-07-04",
        "size": "1804",
        "rating": "0.8125",
        "votes": "16",
        "url": "https://www.doomworld.com/idgames/levels/doom2/g-i/guts",
        "description": ": 1 door and no keys :)",
        "visited": "Yes"
    },
    {
        "id": "20890",
        "title": "BACULUS",
        "filename": "baculus.zip",
        "author": "Glen Christie (Crunchynut44)",
        "date": "2023-10-06",
        "size": "4436392",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/megawads/baculus",
        "description": "An entire megawad from scratch inspired by the likes of Scythe, Plutonia 2 and many many more. An easy going mapset compared to whats out there, designed to appeal to anyone looking for a relaxing general play through.<br><br> The making of this WAD has been a hell of a journey for me, from very humble begginings this mapset has been through one serious development hell. Years and years of slowly getting better at mapping and writing music that is far beyond the scope of these levels now, but im still very happy with the result even if its aged.<br><br> Anyway, enjoy!",
        "visited": "Yes"
    }
]