[
    {
        "id": "19452",
        "title": "HGC_NWExtrem.wad",
        "filename": "hgc_nwextrem.zip",
        "author": "Hans George Campbell",
        "date": "2019-10-05",
        "size": "3687527",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/g-i/hgc_nwextrem",
        "description": "This is the final version of my famous Night Wedding wad. It has been revised to take advantage of GZDoom's lighting effects.",
        "visited": "Yes"
    },
    {
        "id": "13551",
        "title": "Showdown",
        "filename": "dmshow.zip",
        "author": "Rick DeMar",
        "date": "2005-05-26",
        "size": "16705",
        "rating": "1.5",
        "votes": "2",
        "url": "https://www.doomworld.com/idgames/levels/doom/d-f/dmshow",
        "description": "I call this particular level \"Showdown\". The reason for this is probably most apparent early in the game. My favorite four of the enemy list are represented here in droves, and classy weapons and bonuses abound (except for the BFG- 9000, which I thought made things a little too easy, and we can't have that...), as well as some crafty secrets and traps.<br><br> Four things to remember while playing:<br><br> 1:Watch your ammo levels (health too!!) 2:Watch your ass as well! 3:If it smells like a trap, it probably is... 4:All secrets are in sequence; if you miss one, you won't be able to leave!<br><br> It is a real run for your money, but if you keep these things in mind, it's acually kind of easy after awhile ;) . BTW: Don't forget about the strafe maneuver!!",
        "visited": "Yes"
    },
    {
        "id": "14118",
        "title": "Duplex",
        "filename": "dac7.zip",
        "author": "Dr. Zin",
        "date": "2006-01-21",
        "size": "625388",
        "rating": "3.8",
        "votes": "10",
        "url": "https://www.doomworld.com/idgames/themes/DAC/dac2005/dac7",
        "description": "A big split techbase for the Advent 2005 map pack. Please use this version instead of the one under DAC7, as this fixes the Keen bug.",
        "visited": "Yes"
    },
    {
        "id": "18914",
        "title": "The Shores of Russia",
        "filename": "shorus.zip",
        "author": "Chaingunner, Joe-Ilya, Memfis",
        "date": "2017-11-02",
        "size": "347038",
        "rating": "0.0",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom/Ports/s-u/shorus",
        "description": "Three authors, three limit removing maps. Welcome to the shores of Russia.<br><br> e2m1 - Chaingunner e2m2 - joe-ilya e2m3 - Memfis",
        "visited": "Yes"
    },
    {
        "id": "39",
        "title": "None",
        "filename": "fez2.zip",
        "author": "Grahame Fairall",
        "date": "1994-05-06",
        "size": "56534",
        "rating": "2.5",
        "votes": "4",
        "url": "https://www.doomworld.com/idgames/levels/doom/d-f/fez2",
        "description": "Second wad in the 'fez' collection (OK I know it's also E1M1)......lots more evil traps and secrets and a heap more experimentation but predominantly lots of blasting............<br><br> It's hard but everything is possible... however unlikely that may seem....I can do it...<br><br> Now remember......whatever you do.....<br><br> ...make the most of that invincibility..<br><br> As usual all comments/bug reports will be gratefully received....why not send me your wad.....",
        "visited": "Yes"
    },
    {
        "id": "13631",
        "title": "MUDWADS Yeah, thats rite. MUD WAD'S",
        "filename": "dmmud.zip",
        "author": "Dave Swift",
        "date": "2005-06-16",
        "size": "115308",
        "rating": "2.6667",
        "votes": "6",
        "url": "https://www.doomworld.com/idgames/levels/doom/d-f/dmmud",
        "description": "MUD1ST.WAD - My first full length, feature epic type challenge worthy of anyones GOD mode. This beauty has more monsters and demons than you can shake four rocket launchers at. There's a key hidden that you need to get into the room that goes to the next level. All difficulties are the same... hard! There is a lot going on so this may tax some less than lightspeed machines but you got it all here. Some secret rooms will help you. Bigtime.<br><br> MUDTOWN.WAD - Second one here, this one does have an easier difficuly setting (easier than totally impossible) and has more acurate texture matches for all areas and more refined challenges. There's a key hidden that you have to find to get into the room to the next level. Watch out on Diff 3/4 - it'll work you! Diff 1/2 are the same - doable. Good luck.<br><br> MUDVILLE.WAD - Third one's the charm. Well, there are teleporters and more new stuff... for me to do anyway. A good technical game. No secret rooms to speak of but a real good challenge for the purist. Diff 1/2 are doable... not too hard actually. 3/4 are another story. Strap on the big gun. Loop around and catch the trip wire to the door. Hang on!<br><br> MUDMANOR.WAD - This one is more and better.... skill levels cover possible to impossible. Ample weapons in the possible levels. Perhaps enough in the more difficult \"impossible\" levels too. No keys but it is necessary to take the long way around to finish. Enjoy!<br><br> What's with Mud, you may ask. And well you may. I am Pres of The West Mountain Mudbrothers Mountainbiking Club and as such the word (and substance) have a great deal of significance in everyday life. Besides how else would you know for sure that it was the \"Muds\" work unless I made it obvious when you tabbed to map in strategic spots.",
        "visited": "Yes"
    },
    {
        "id": "9438",
        "title": "The DOOM matrix utilties",
        "filename": "wtf-dmu.zip",
        "author": "WTF Productions",
        "date": "1998-05-25",
        "size": "36623",
        "rating": "0.5",
        "votes": "2",
        "url": "https://www.doomworld.com/idgames/themes/wtf/wtf-dmu",
        "description": "This ZIP file contains all you need to keep track of the scores during\na DOOM fest. It works fully automatic with batchfiles created with a \nhelpful front-end tool. Manual is included, tools are FREEWARE!!",
        "visited": "Yes"
    },
    {
        "id": "16567",
        "title": "Fae Pente",
        "filename": "faepente.zip",
        "author": "Michael \"Optimus\" Kargas",
        "date": "2011-09-02",
        "size": "28320",
        "rating": "0.5294",
        "votes": "17",
        "url": "https://www.doomworld.com/idgames/levels/doom/d-f/faepente",
        "description": "I was inspired by 5 minutes WAD and it came very bad!!!",
        "visited": "Yes"
    },
    {
        "id": "16567",
        "title": "Doom 404",
        "filename": "doom404.zip",
        "author": "Adam Windsor / Capellan",
        "date": "2018-12-02",
        "size": "1097423",
        "rating": "0.0000",
        "votes": "0",
        "url": "https://www.doomworld.com/idgames/levels/doom2/megawads/doom404",
        "description": "It's a sad life on the Space Marine IT Help Desk. Especially when you're stuck on the graveyard shift. Night after night of \"Did you try rebooting?\" Not exactly what you expected when you signed up.<br><br> You figured this call would be more of the same: some garbled voice mail about \"gremlins in the system\". Gremlins? Seriously, how old is the guy who left that? Ninety five? He probably remembers vacuum tubes.<br><br> Now you're here though, something isn't right. This facility should be busy, but it's silent. Almost desolate. You're starting to feel glad you brought that popgun they issued you with to make you look like a real soldier ...",
        "visited": "Yes"
    },
    {
        "id": "17980",
        "title": "Abyssal Speedmapping Sessions: Session 14",
        "filename": "abyspe14.zip",
        "author": "Obsidian Jimmy Unholypimpin Scifista42 TheMionicDonut SlashBane AD_79 Alfonzo Breezeep General Rainb",
        "date": "2015-01-29",
        "size": "544203",
        "rating": "1.5714",
        "votes": "14",
        "url": "https://www.doomworld.com/idgames/levels/doom2/Ports/a-c/abyspe14",
        "description": "11 maps made during the eleventh Abyssal Speedmapping Session in the space of two hours, with 15 minutes for music and texture selection and 15 minutes for bugfixing. Each mapper had 3 themes to choose from:<br><br> - Raising stairs function - Perpetual moving floors - Lite-Amp goggles<br><br> Alfonzo, AD_79 and SlashBane used the Alfonzo treatment and SlashBane used another 20 minutes or so.",
        "visited": "Yes"
    },
    {
        "id": "14081",
        "title": "Such a Pretty Sight",
        "filename": "dm2sig.zip",
        "author": "Ashley Gilliam",
        "date": "2005-12-30",
        "size": "17743",
        "rating": "4.0",
        "votes": "1",
        "url": "https://www.doomworld.com/idgames/levels/doom2/deathmatch/d-f/dm2sig",
        "description": "This is a small WAD for Deathmatch. Set on a small islandish piece of ground. A few hiding places, some interesting spaces, and some delightful surprise kills.<br><br> Story: It is such a pretty view you'd just like to sit and enjoy it--but that other guy with the shotgun just isn't gonna let you!",
        "visited": "Yes"
    }
]